uhnp/src/InformationRegisters/ЗначенияАналитикОбъектов/ЗначенияАналитикОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияАналитикОбъектов</name>
  <dimensions>
    <name>ОбъектУчета</name>
    <type>
      <types>CatalogRef.ЭтапыУниверсальныхПроцессов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШаблонДокумента</name>
    <type>
      <types>DefinedType.ШаблонДокументаБД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проекты</name>
  <comment>(-УХПредставлениеСписка)(-УХПредставлениеОбъекта)</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ПроектЭтапа</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ДлительностьДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяСтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяСтатьяДоходовИРасходов</name>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОсновнаяВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяВалютаПлатежей</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесовойКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_СметнаяСтоимостьБазовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_СметнаяСтоимостьТекущая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделИнвестиционнойПрограммы</name>
    <type>
      <types>CatalogRef.РазделыИнвестиционныхПрограмм</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФункциональноеНаправление</name>
    <type>
      <types>CatalogRef.ФункциональныеНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтавкаДисконтирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйПользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеОцениваетсяПоКритериям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьРасчетаАнализаKPI</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельРасчетаПоказателейПроекта</name>
    <type>
      <types>CatalogRef.ВерсииРегламентовПодготовкиОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОтображенияМоделиРасчета</name>
    <type>
      <types>CatalogRef.БланкиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойСценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПроектыПредшественники</name>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПартнерыИКонтактныеЛица</name>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>РольПартнера</name>
      <type>
        <types>CatalogRef.РолиПартнеровВСделкахИПроектах</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/InformationRegisters/ЗначенияАналитикОбъектов/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Объект", ОбъектУчета);
	Параметры.Свойство("ШаблонДокумента", ШаблонДокумента);
	
	Если ЗначениеЗаполнено(ОбъектУчета) Тогда
		Элементы.ОбъектУчета.Видимость = Ложь;
	КонецЕсли;
	Если ЗначениеЗаполнено(ШаблонДокумента) Тогда
		Элементы.ШаблонДокумента.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ИнициализироватьДанныеАналитик();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Значения аналитик были изменены. Сохранить изменения?'");
		Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемПродолжение", ЭтаФорма);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемПродолжение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаписатьНаСервере();
		Закрыть();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбъектУчетаПриИзменении(Элемент)
	ИнициализироватьДанныеАналитик();
КонецПроцедуры

&НаКлиенте
Процедура ШаблонДокументаПриИзменении(Элемент)
	ИнициализироватьДанныеАналитик();
КонецПроцедуры

&НаКлиенте
Процедура ПроектыПриИзменении(Элемент)
	СформироватьНаборыАналитик();
КонецПроцедуры

&НаКлиенте
Процедура ПроектыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ОбработкаПодбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Аналитики1ПриИзменении(Элемент)
	СформироватьНаборыАналитик();
КонецПроцедуры

&НаКлиенте
Процедура Аналитики1ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ОбработкаПодбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Аналитики2ПриИзменении(Элемент)
	СформироватьНаборыАналитик();
КонецПроцедуры

&НаКлиенте
Процедура Аналитики2ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ОбработкаПодбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Аналитики3ПриИзменении(Элемент)
	СформироватьНаборыАналитик();
КонецПроцедуры

&НаКлиенте
Процедура Аналитики3ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ОбработкаПодбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Аналитики4ПриИзменении(Элемент)
	СформироватьНаборыАналитик();
КонецПроцедуры

&НаКлиенте
Процедура Аналитики4ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ОбработкаПодбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Аналитики5ПриИзменении(Элемент)
	СформироватьНаборыАналитик();
КонецПроцедуры

&НаКлиенте
Процедура Аналитики5ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ОбработкаПодбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Аналитики6ПриИзменении(Элемент)
	СформироватьНаборыАналитик();
КонецПроцедуры

&НаКлиенте
Процедура Аналитики6ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ОбработкаПодбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыАналитики

&НаКлиенте
Процедура АналитикиПриИзменении(Элемент)

	Если Элемент.ТекущийЭлемент = Элементы.АналитикиВыбор Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьИсточникиАналитик();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыделитьВсе(Команда)
	
	Для Каждого СтрокаТаблицы Из Аналитики Цикл
		СтрокаТаблицы.Используется = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыделениеВсех(Команда)
	
	Для Каждого СтрокаТаблицы Из Аналитики Цикл
		СтрокаТаблицы.Используется = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЗаписатьНаСервере();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	ЗаписатьНаСервере();
	ИнициализироватьДанныеАналитик();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработкаПодбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Для Каждого Значение Из ВыбранноеЗначение Цикл
		ЭтаФорма[Элемент.Имя].Добавить(Значение);
	КонецЦикла;
	СформироватьНаборыАналитик();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьДанныеАналитик()
	
	ДанныеШаблона = БюджетированиеИОтчетностьПовтИсп.ДанныеВидаОтчета(ШаблонДокумента);
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ДанныеШаблона);
	
	Элементы.СтраницаПроекты.Видимость = РазделениеПоПроектам;
	Элементы.АналитикиПроект.Видимость = РазделениеПоПроектам;
		
	Для Сч = 1 По МаксКлючевыхАналитик Цикл
		Элементы["СтраницаАналитика" + Сч].Видимость = Истина;
		ЭтаФорма["Аналитики" + Сч].ТипЗначения = ДанныеШаблона["ТипЗначенияАналитики" + Сч];
		Элементы["АналитикиАналитика" + Сч].Видимость = Истина;
		Элементы["АналитикиАналитика" + Сч].ОграничениеТипа = ДанныеШаблона["ТипЗначенияАналитики" + Сч];
	КонецЦикла;
	Для Сч = МаксКлючевыхАналитик+1 По ПараметрыСеанса.ЧислоДопАналитик Цикл
		Элементы["СтраницаАналитика" + Сч].Видимость = Ложь;
		Элементы["АналитикиАналитика" + Сч].Видимость = Ложь;
	КонецЦикла;
	
	Если (МаксКлючевыхАналитик + ?(РазделениеПоПроектам, 1, 0)) > 1 Тогда
		Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Авто;
	Иначе
		Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	КонецЕсли;
	
	// Получим данные из регистра
	НаборЗаписей = РегистрыСведений.ЗначенияАналитикОбъектов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектУчета.Установить(ОбъектУчета);
	НаборЗаписей.Отбор.ШаблонДокумента.Установить(ШаблонДокумента);
	НаборЗаписей.Прочитать();
	тАналитики = НаборЗаписей.Выгрузить();
	
	ЗаполнитьИсточникиАналитик(тАналитики);
	СформироватьНаборыАналитик(тАналитики);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаборыАналитик(Знач тАналитики = Неопределено)
	
	// Запомним отметки строк
	Если тАналитики = Неопределено Тогда
		тАналитики = Аналитики.Выгрузить(Новый Структура("Используется", Истина));
		Модифицированность = Истина;
	КонецЕсли;
	
	// Сформируем новую таблицу
	Аналитики.Очистить();
	СтруктураАналитик = Новый Структура;
	
	Если РазделениеПоПроектам Тогда
		
		Если Проекты.Количество() = 0 Тогда
			СтруктураАналитик.Вставить("Проект", Справочники.Проекты.ПустаяСсылка());
			ДобавитьАналитики(СтруктураАналитик, 0);
		Иначе
			Для Каждого СтрокаПроект Из Проекты Цикл
				СтруктураАналитик.Вставить("Проект", СтрокаПроект.Значение);
				ДобавитьАналитики(СтруктураАналитик, 0);
			КонецЦикла;
		КонецЕсли;
		
	Иначе
		ДобавитьАналитикиРекурсивно(СтруктураАналитик, 1);
	КонецЕсли;
	
	// Восстановим отметки строк
	Для Каждого ПрошлаяСтрока Из тАналитики Цикл
		ЗаполнитьЗначенияСвойств(СтруктураАналитик, ПрошлаяСтрока);
		НайденныеСтроки = Аналитики.НайтиСтроки(СтруктураАналитик);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НайденнаяСтрока.Используется = Истина;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьАналитикиРекурсивно(СтруктураАналитик, НомерАналитики)
	
	Если НомерАналитики > МаксКлючевыхАналитик Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеАналитики = ЭтаФорма["Аналитики" + НомерАналитики];
	Если ТекущиеАналитики.Количество() = 0 Тогда
		СтруктураАналитик.Вставить("Аналитика" + НомерАналитики, ТекущиеАналитики.ТипЗначения.ПривестиЗначение());
		ДобавитьАналитики(СтруктураАналитик, НомерАналитики);
	Иначе
		Для Каждого СтрокаАналитика Из ТекущиеАналитики Цикл
			СтруктураАналитик.Вставить("Аналитика" + НомерАналитики, СтрокаАналитика.Значение);
			ДобавитьАналитики(СтруктураАналитик, НомерАналитики);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ДобавитьАналитики(СтруктураАналитик, НомерАналитики)

	Если МаксКлючевыхАналитик = НомерАналитики Тогда
		НоваяСтрока = Аналитики.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураАналитик);
	Иначе
		ДобавитьАналитикиРекурсивно(СтруктураАналитик, НомерАналитики+1);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсточникиАналитик(Знач тАналитики = Неопределено)
	
	Если тАналитики = Неопределено Тогда
		тАналитики = Аналитики.Выгрузить();
	КонецЕсли;
	
	Если РазделениеПоПроектам Тогда
		
		тДанные = тАналитики.Скопировать(,"Проект");
		тДанные.Свернуть("Проект");
		
		Проекты.ЗагрузитьЗначения(тДанные.ВыгрузитьКолонку("Проект"));
		
	КонецЕсли;
	
	Для Сч = 1 По МаксКлючевыхАналитик Цикл
		
		ИмяАналитики = "Аналитика" + Сч;
		тДанные = тАналитики.Скопировать(,ИмяАналитики);
		тДанные.Свернуть(ИмяАналитики);
		
		ЭтаФорма["Аналитики" + Сч].ЗагрузитьЗначения(тДанные.ВыгрузитьКолонку(ИмяАналитики));
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	Если Не Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	тАналитики = Аналитики.Выгрузить(Новый Структура("Используется", Истина));
	тАналитики.Колонки.Добавить("ОбъектУчета");
	тАналитики.ЗаполнитьЗначения(ОбъектУчета, "ОбъектУчета");
	тАналитики.Колонки.Добавить("ШаблонДокумента");
	тАналитики.ЗаполнитьЗначения(ШаблонДокумента, "ШаблонДокумента");
	
	НаборЗаписей = РегистрыСведений.ЗначенияАналитикОбъектов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектУчета.Установить(ОбъектУчета);
	НаборЗаписей.Отбор.ШаблонДокумента.Установить(ШаблонДокумента);
	НаборЗаписей.Загрузить(тАналитики);
	
	НаборЗаписей.Записать();
	Модифицированность = Ложь;
	
КонецПроцедуры

#КонецОбласти
